## Plan Result (prod_app_registrations)




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/CFT-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/CFT-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Heritage-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Heritage-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Platform-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Platform-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/SDS-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/SDS-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Security&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Heritage-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Security"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations","Vars":{}} -->